app/Controllers/BlogController.php

    public function index()
    {
        $data = [];
         $data['passLink'] = "clubmembership";

        $BlogModel = new BlogModel();
        $data['all_blogs'] = $BlogModel->findAll();

        $CategoryModel = new CategoryModel();
        $data['all_categories'] = $CategoryModel->findAll();
---
SELECT *
FROM `blog`
SELECT *
FROM `categories`