app/Controllers/Dashboard.php

        // ============== TABLES ================

        // table containg club payment summary
        $data['club_payments_summary_log'] = $ClubDueLogModel->table('due_pmt_log')
                                                            ->select('due_pmt_log.*, membership_applicants.*, SUM(due_pmt_log.due_amount) as total_saved, membership_applicants.profileImg as memBerpic, membership_applicants.fullName as agentName')
                                                            ->join('membership_applicants', 'membership_applicants.memberSerialNo = due_pmt_log.mem_serial_no')
                                                            ->where('due_pmt_log.approved_status', 'Approved')
                                                            ->groupBy('due_pmt_log.mem_serial_no')
                                                            ->orderBy('due_pmt_log.id', 'desc')
                                                            ->get()
                                                            ->getResult();

                // table containg loan payment summary
        $data['loan_payments_summary_log'] = $LoanLogModel->table('loan_pmt_log')
                                                            ->select('loan_pmt_log.*, loan_application.*, SUM(loan_pmt_log.amount) as totalPaid, loan_application.applicantImg as memBerpic, loan_application.fullName as agentName, loan_application.id as applicantId')
                                                            ->join('loan_application', 'loan_application.serial_no = loan_pmt_log.serial_no')
                                                            ->where('loan_pmt_log.isApproved', 'Approved')
                                                            ->groupBy('loan_pmt_log.serial_no')
                                                            ->orderBy('loan_pmt_log.id', 'desc')
                                                            ->get()
                                                            ->getResult();
        // get all team members
        $data['users_table'] = $TeamModel->findAll();
---
SELECT `due_pmt_log`.*, `membership_applicants`.*, SUM(due_pmt_log.due_amount) as total_saved, `membership_applicants`.`profileImg` as `memBerpic`, `membership_applicants`.`fullName` as `agentName`
FROM `due_pmt_log`
JOIN `membership_applicants` ON `membership_applicants`.`memberSerialNo` = `due_pmt_log`.`mem_serial_no`
WHERE `due_pmt_log`.`approved_status` = 'Approved'
GROUP BY `due_pmt_log`.`mem_serial_no`
ORDER BY `due_pmt_log`.`id` DESC
SELECT `loan_pmt_log`.*, `loan_application`.*, SUM(loan_pmt_log.amount) as totalPaid, `loan_application`.`applicantImg` as `memBerpic`, `loan_application`.`fullName` as `agentName`, `loan_application`.`id` as `applicantId`
FROM `loan_pmt_log`
JOIN `loan_application` ON `loan_application`.`serial_no` = `loan_pmt_log`.`serial_no`
WHERE `loan_pmt_log`.`isApproved` = 'Approved'
GROUP BY `loan_pmt_log`.`serial_no`
ORDER BY `loan_pmt_log`.`id` DESC
SELECT *
FROM `team`