app/Controllers/PortfolioController.php

SELECT *
FROM `portfolio`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `portfolio`
SELECT *
FROM `categories`
---
    public function index(){
        $data = [];

        $PortfolioModel = new PortfolioModel();
        $CategoryModel = new CategoryModel();

        $data = [
                'all_portfolio' => $PortfolioModel->orderBy('id', 'desc')->paginate(10),
                'pager' => $PortfolioModel->pager,
            ];

        $data['all_categories'] = $CategoryModel->findAll();