app/Controllers/ServicesController.php

SELECT *
FROM `services`
---
    public function index(){

      $data = [];
      $data['passLink'] = "services";
      $data['userData'] = session()->get('userData');

      $servicesModel = new servicesModel();
      $data['all_services'] = $servicesModel->findAll();