app/Models/BlogModel.php

public function blog_post_to_read($id)
    {
            return $this->db->table('blog')
                    ->where('blog.id', $id)
                    ->join('team', 'blog.createdBy = team.email')
                    ->get()->getResult();
---
SELECT *
FROM `blog`
JOIN `team` ON `blog`.`createdBy` = `team`.`email`
WHERE `blog`.`id` = 'assets'