app/Models/ClubDueLogModel.php

SELECT `team`.*, `due_pmt_log`.*, `due_pmt_log`.`id` as `paymentId`, `membership_applicants`.*, `team`.`fullName` as `teamMemName`, `membership_applicants`.`fullName` as `memberFullName`
FROM `due_pmt_log`
JOIN `team` ON `team`.`id` = `due_pmt_log`.`recordedBy`
JOIN `membership_applicants` ON `membership_applicants`.`memberSerialNo` = `due_pmt_log`.`mem_serial_no`
WHERE `due_pmt_log`.`approved_status` = 'Approved'
ORDER BY `due_pmt_log`.`id` DESC
---
  public function return_payment_log($status){

    $data = $this->db->table('due_pmt_log')
        ->select('team.*, due_pmt_log.*, due_pmt_log.id as paymentId, membership_applicants.*, team.fullName as teamMemName, membership_applicants.fullName as memberFullName')
        ->join('team', 'team.id = due_pmt_log.recordedBy')
        ->join('membership_applicants', 'membership_applicants.memberSerialNo = due_pmt_log.mem_serial_no')
        ->where('due_pmt_log.approved_status', $status)
        ->orderBy('due_pmt_log.id','desc')
        ->get()
        ->getResult();

SELECT `team`.*, `due_pmt_log`.*, `membership_applicants`.*, `team`.`fullName` as `teamMemName`, `membership_applicants`.`fullName` as `memberFullName`, `due_pmt_log`.`id` as `logId`
FROM `due_pmt_log`
JOIN `team` ON `team`.`id` = `due_pmt_log`.`recordedBy`
JOIN `membership_applicants` ON `membership_applicants`.`memberSerialNo` = `due_pmt_log`.`mem_serial_no`
WHERE `due_pmt_log`.`approved_status` = 'Pending'
AND `membership_applicants`.`memberSerialNo` = 'Az4Qdz'
ORDER BY `due_pmt_log`.`id` DESC
---
  public function a_member_payment_log($status, $serial){

    $data = $this->db->table('due_pmt_log')
        ->select('team.*, due_pmt_log.*,membership_applicants.*, team.fullName as teamMemName, membership_applicants.fullName as memberFullName, due_pmt_log.id as logId')
        ->join('team', 'team.id = due_pmt_log.recordedBy')
        ->join('membership_applicants', 'membership_applicants.memberSerialNo = due_pmt_log.mem_serial_no')
        ->where('due_pmt_log.approved_status', $status)
        ->where('membership_applicants.memberSerialNo', $serial)
        ->orderBy('due_pmt_log.id','desc')
        ->get()
        ->getResult();

SELECT *, SUM(due_pmt_log.due_amount) as total_paid
FROM `due_pmt_log`
WHERE `due_pmt_log`.`mem_serial_no` = 'Az4Qdz'
AND `due_pmt_log`.`approved_status` = 'Pending'
---
public function get_a_mem_due_total($serial, $approved_status)
{
     $data = $this->db->table('due_pmt_log')
        ->select('*, SUM(due_pmt_log.due_amount) as total_paid')
        ->where('due_pmt_log.mem_serial_no', $serial)
        ->where('due_pmt_log.approved_status', $approved_status)
        ->get()
        ->getRow();