app/Models/ClubReportModel.php

SELECT `team`.*, `due_pmt_log`.*, `due_pmt_log`.`id` as `paymentId`, `membership_applicants`.*, `team`.`fullName` as `teamMemName`, `membership_applicants`.`fullName` as `memberFullName`
FROM `due_pmt_log`
JOIN `team` ON `team`.`id` = `due_pmt_log`.`recordedBy`
JOIN `membership_applicants` ON `membership_applicants`.`memberSerialNo` = `due_pmt_log`.`mem_serial_no`
WHERE `due_pmt_log`.`recordedDate` >= '2024-01-12'
AND `due_pmt_log`.`recordedDate` <= '2024-01-28'
ORDER BY `due_pmt_log`.`id` DESC
---
  public function get_all_report_payment_log($startDate, $endDate){

    $data = $this->db->table('due_pmt_log')
        ->select('team.*, due_pmt_log.*, due_pmt_log.id as paymentId, membership_applicants.*, team.fullName as teamMemName, membership_applicants.fullName as memberFullName')
        ->join('team', 'team.id = due_pmt_log.recordedBy')
        ->join('membership_applicants', 'membership_applicants.memberSerialNo = due_pmt_log.mem_serial_no')
        ->where('due_pmt_log.recordedDate >=', $startDate)
        ->where('due_pmt_log.recordedDate <=', $endDate)
        ->orderBy('due_pmt_log.id','desc')
        ->get()
        ->getResult();

SELECT *, SUM(due_pmt_log.due_amount) as total_paid
FROM `due_pmt_log`
WHERE `due_pmt_log`.`due_currency` = 'LRD'
AND `due_pmt_log`.`approved_status` = 'Pending'
AND `due_pmt_log`.`recordedDate` >= '2024-01-12'
AND `due_pmt_log`.`recordedDate` <= '2024-01-28'
---
public function get_report_payment_total($status, $currency, $startDate, $endDate)
{
     $result = $this->db->table('due_pmt_log')
        ->select('*, SUM(due_pmt_log.due_amount) as total_paid')
        ->where('due_pmt_log.due_currency', $currency)
        ->where('due_pmt_log.approved_status', $status)
        ->where('due_pmt_log.recordedDate >=', $startDate)
        ->where('due_pmt_log.recordedDate <=', $endDate)
        ->get()
        ->getRow();