app/Models/ClubMembershipModel.php

SELECT `team`.*, `membership_applicants`.*, `team`.`fullName` as `agentName`, `membership_applicants`.`profileImg` as `memBerpic`
FROM `membership_applicants`
JOIN `team` ON `team`.`id` = `membership_applicants`.`registeredBy`
WHERE `membership_applicants`.`accountStatus` = 'Approved'
ORDER BY `membership_applicants`.`id` DESC
---
  public function return_member_log($status){
   $data = $this->db->table('membership_applicants')
                ->select('team.*, membership_applicants.*, team.fullName as agentName, membership_applicants.profileImg as memBerpic')
                ->join('team', 'team.id = membership_applicants.registeredBy')
                ->where('membership_applicants.accountStatus', $status)
                ->orderBy('membership_applicants.id', 'desc')
                ->get()
                ->getResult();

SELECT `team`.*, `membership_applicants`.*, `team`.`fullName` as `agentName`, `membership_applicants`.`profileImg` as `memBerpic`
FROM `membership_applicants`
JOIN `team` ON `team`.`id` = `membership_applicants`.`registeredBy`
WHERE `membership_applicants`.`memberSerialNo` = 'Az4Qdz'
ORDER BY `membership_applicants`.`id` DESC
---
  public function a_member_profile_log($serial){
   $data = $this->db->table('membership_applicants')
                ->select('team.*, membership_applicants.*, team.fullName as agentName, membership_applicants.profileImg as memBerpic')
                ->join('team', 'team.id = membership_applicants.registeredBy')
                ->where('membership_applicants.memberSerialNo', $serial)
                ->orderBy('membership_applicants.id', 'desc')
                ->get()
                ->getResult();