app/Models/LoanLogModel.php

SELECT *, `loan_application`.`fullName` as `payBy`, `loan_pmt_log`.`id` as `payment_id`
FROM `loan_pmt_log`
JOIN `loan_application` ON `loan_application`.`serial_no` = `loan_pmt_log`.`serial_no`
JOIN `team` ON `loan_pmt_log`.`loggedBy` = `team`.`id`
WHERE `loan_pmt_log`.`isApproved` = 'Pending'
ORDER BY `loan_pmt_log`.`loggedDate` DESC
---
   public function all_pending_loan_payments($approveStatus){
   		$data = $this->db->table('loan_pmt_log')
   				->select('*, loan_application.fullName as payBy, loan_pmt_log.id as payment_id')
   				->join('loan_application', 'loan_application.serial_no = loan_pmt_log.serial_no')
   				->join('team', 'loan_pmt_log.loggedBy = team.id')
          ->where('loan_pmt_log.isApproved', $approveStatus)
   				->orderBy('loan_pmt_log.loggedDate', 'desc')
          ->get()
          ->getResult();

SELECT *, SUM(loan_pmt_log.amount) as total_pmt, `loan_application`.`serial_no` as `applicantSerial`
FROM `loan_pmt_log`
JOIN `loan_application` ON `loan_pmt_log`.`serial_no` = `loan_application`.`serial_no`
WHERE `loan_pmt_log`.`serial_no` = `loan_application`.`serial_no`
GROUP BY `loan_application`.`serial_no`
ORDER BY `loan_application`.`loanStartDate`
---
  public function get_payment_summary(){

	  	$data = $this->db->table('loan_pmt_log')
	  			->select('*, SUM(loan_pmt_log.amount) as total_pmt, loan_application.serial_no as applicantSerial')
	  			->where('loan_pmt_log.serial_no = loan_application.serial_no')
	  			->join('loan_application', 'loan_pmt_log.serial_no = loan_application.serial_no')
	  			->groupBy('loan_application.serial_no')
	  			->orderBy('loan_application.loanStartDate')
	  			->get()
	  			->getResult();

SELECT *, `loan_application`.`fullName` as `payBy`, `loan_pmt_log`.`id` as `payment_id`, `loan_application`.`id` as `applicantId`
FROM `loan_pmt_log`
JOIN `loan_application` ON `loan_application`.`serial_no` = `loan_pmt_log`.`serial_no`
JOIN `team` ON `loan_pmt_log`.`loggedBy` = `team`.`id`
WHERE `loan_application`.`serial_no` = 'b4Oxe6'
AND `loan_pmt_log`.`isApproved` = 'Pending'
ORDER BY `loan_pmt_log`.`loggedDate` DESC
---
    public function get_loan_applicants_log($serial, $approveStatus){

      $data = $this->db->table('loan_pmt_log')
          ->select('*, loan_application.fullName as payBy, loan_pmt_log.id as payment_id, loan_application.id as applicantId')
          ->join('loan_application', 'loan_application.serial_no = loan_pmt_log.serial_no')
          ->where("loan_application.serial_no",$serial)
          ->where('loan_pmt_log.isApproved', $approveStatus)
          ->join('team', 'loan_pmt_log.loggedBy = team.id')
          ->orderBy('loan_pmt_log.loggedDate', 'desc')
          ->get()
          ->getResult();

SELECT *, SUM(loan_pmt_log.amount) as total_paid
FROM `loan_pmt_log`
WHERE `loan_pmt_log`.`serial_no` = 'b4Oxe6'
AND `loan_pmt_log`.`isApproved` = 'Approved'
---
    public function total_loan_paid_by_applicant($serial, $approveStatus){

         $data = $this->db->table('loan_pmt_log')
        ->select('*, SUM(loan_pmt_log.amount) as total_paid')
        ->where('loan_pmt_log.serial_no', $serial)
        ->where('loan_pmt_log.isApproved', $approveStatus)
        ->get()
        ->getRow();