app/Models/LoanApplicantModel.php

    public function get_loan_applicants_log(){
        return $this->db->table('loan_application')
                ->select('*, loan_application.fullName as applicantName, loan_application.id as applicant_id')
                ->join('team', 'team.id = loan_application.regBy')
                ->orderBy('loan_application.lstEdited', 'desc')
                ->get()
                ->getResult();
---
SELECT *, `loan_application`.`fullName` as `applicantName`, `loan_application`.`id` as `applicant_id`
FROM `loan_application`
JOIN `team` ON `team`.`id` = `loan_application`.`regBy`
ORDER BY `loan_application`.`lstEdited` DESC