app/Models/LoanApplicantModel.php

SELECT *, `loan_application`.`fullName` as `applicantName`, `loan_application`.`id` as `applicant_id`
FROM `loan_application`
JOIN `team` ON `team`.`id` = `loan_application`.`regBy`
WHERE `loan_application`.`approv_status` = 'Pending'
ORDER BY `loan_application`.`lstEdited` DESC
---
    public function get_loan_applicants_log($approv_status){
        return $this->db->table('loan_application')
                ->select('*, loan_application.fullName as applicantName, loan_application.id as applicant_id')
                ->join('team', 'team.id = loan_application.regBy')
                ->where('loan_application.approv_status', $approv_status)
                ->orderBy('loan_application.lstEdited', 'desc')
                ->get()
                ->getResult();