app/Models/LoanReportModel.php

SELECT `loan_pmt_log`.*, `loan_application`.*, SUM(loan_pmt_log.amount) as totalPaid, `loan_application`.`applicantImg` as `memBerpic`, `loan_application`.`fullName` as `agentName`, `loan_application`.`id` as `applicantId`
FROM `loan_pmt_log`
JOIN `loan_application` ON `loan_application`.`serial_no` = `loan_pmt_log`.`serial_no`
WHERE `loan_pmt_log`.`isApproved` = 'Approved'
AND `loan_pmt_log`.`loggedDate` >= '2023-11-01'
AND `loan_pmt_log`.`loggedDate` <= '2024-01-28'
GROUP BY `loan_pmt_log`.`serial_no`
ORDER BY `loan_pmt_log`.`id` DESC
---
  public function get_payment_summary($startDate, $endDate){

      $data = $this->db->table('loan_pmt_log')
          ->select('loan_pmt_log.*, loan_application.*, SUM(loan_pmt_log.amount) as totalPaid, loan_application.applicantImg as memBerpic, loan_application.fullName as agentName, loan_application.id as applicantId')
          ->join('loan_application', 'loan_application.serial_no = loan_pmt_log.serial_no')
          ->where('loan_pmt_log.isApproved', 'Approved')
          ->where('loan_pmt_log.loggedDate >=', $startDate)
          ->where('loan_pmt_log.loggedDate <=', $endDate)
          ->groupBy('loan_pmt_log.serial_no')
          ->orderBy('loan_pmt_log.id', 'desc')
          ->get()
          ->getResult();