app/Models/LoanLogModel.php

   public function get_loan_log(){

   		$data = $this->db->table('loan_pmt_log')
   				->select('*, loan_application.fullName as payBy, loan_pmt_log.id as payment_id')
   				->join('loan_application', 'loan_application.serial_no = loan_pmt_log.serial_no')
   				->join('team', 'loan_pmt_log.loggedBy = team.id')
   				->orderBy('loan_pmt_log.loggedDate', 'desc')
                ->get()
                ->getResult();
---
SELECT *, `loan_application`.`fullName` as `payBy`, `loan_pmt_log`.`id` as `payment_id`
FROM `loan_pmt_log`
JOIN `loan_application` ON `loan_application`.`serial_no` = `loan_pmt_log`.`serial_no`
JOIN `team` ON `loan_pmt_log`.`loggedBy` = `team`.`id`
ORDER BY `loan_pmt_log`.`loggedDate` DESC