app/Models/LoanReportModel.php

SELECT *, `loan_application`.`fullName` as `payBy`, `loan_pmt_log`.`id` as `payment_id`
FROM `loan_pmt_log`
JOIN `loan_application` ON `loan_application`.`serial_no` = `loan_pmt_log`.`serial_no`
JOIN `team` ON `loan_pmt_log`.`loggedBy` = `team`.`id`
WHERE `loan_pmt_log`.`loggedDate` >= '2023-11-01'
AND `loan_pmt_log`.`loggedDate` <= '2024-01-28'
ORDER BY `loan_pmt_log`.`loggedDate` DESC
---
  public function allpayments($startDate, $endDate) {
    $data = $this->db->table('loan_pmt_log')
        ->select('*, loan_application.fullName as payBy, loan_pmt_log.id as payment_id')
        ->join('loan_application', 'loan_application.serial_no = loan_pmt_log.serial_no')
        ->join('team', 'loan_pmt_log.loggedBy = team.id')
        ->where('loan_pmt_log.loggedDate >=', $startDate)
        ->where('loan_pmt_log.loggedDate <=', $endDate)
        ->orderBy('loan_pmt_log.loggedDate', 'desc')
        ->get()
        ->getResult();

SELECT *, SUM(loan_pmt_log.amount) as total_pmt, `loan_application`.`serial_no` as `applicantSerial`
FROM `loan_pmt_log`
JOIN `loan_application` ON `loan_pmt_log`.`serial_no` = `loan_application`.`serial_no`
WHERE `loan_pmt_log`.`serial_no` = `loan_application`.`serial_no`
AND `loan_pmt_log`.`loggedDate` >= '2023-11-01'
AND `loan_pmt_log`.`loggedDate` <= '2024-01-28'
GROUP BY `loan_application`.`serial_no`
ORDER BY `loan_application`.`loanStartDate`
---
  public function get_payment_summary($startDate, $endDate){

      $data = $this->db->table('loan_pmt_log')
          ->select('*, SUM(loan_pmt_log.amount) as total_pmt, loan_application.serial_no as applicantSerial')
          ->where('loan_pmt_log.serial_no = loan_application.serial_no')
          ->join('loan_application', 'loan_pmt_log.serial_no = loan_application.serial_no')
          ->where('loan_pmt_log.loggedDate >=', $startDate)
          ->where('loan_pmt_log.loggedDate <=', $endDate)
          ->groupBy('loan_application.serial_no')
          ->orderBy('loan_application.loanStartDate')
          ->get()
          ->getResult();

SELECT SUM(`amount`) AS `totalAmount`
FROM `loan_pmt_log`
WHERE `pmtCurrency` = 'LRD'
AND `isApproved` = 'Pending'
AND `loggedDate` >= '2023-11-01'
AND `loggedDate` <= '2024-01-28'
---
  public function sumLoanPaidByCurrency($currency, $status, $startDate, $endDate) {
    $result = $this->db->table('loan_pmt_log')
        ->selectSum('amount', 'totalAmount')
        ->where('pmtCurrency', $currency)
        ->where('isApproved', $status)
        ->where('loggedDate >=', $startDate)
        ->where('loggedDate <=', $endDate)
        ->get()
        ->getRow();

SELECT SUM(`loanAmount`) AS `totalLoanAmount`
FROM `loan_application`
WHERE `loanStartDate` >= '2023-11-01'
AND `loanStartDate` <= '2024-01-28'
AND `approv_status` = 'Approved'
AND `currency` = 'LRD'
---
public function sumLoanCreditedAmount($currency, $status, $startDate, $endDate) {
    $result = $this->db->table('loan_application')
        ->selectSum('loanAmount', 'totalLoanAmount')
        ->where('loanStartDate >=', $startDate)
        ->where('loanEndDate <=', $endDate)
        ->where('approv_status', $status)
        ->where('currency', $currency)
        ->get()
        ->getRow();